In [4]:
import pandas as pd

## Parameter header is for the row number to use as the column names
We need wen not set columns names in the file and index set

In [9]:
pd.read_csv('titanic.csv', header=1)

     0  3    male  22.0  1  0.1     7.25  S Unnamed: 8
0    1  1  female  38.0  1    0  71.2833  C          C
1    1  3  female  26.0  0    0   7.9250  S        NaN
2    1  1  female  35.0  1    0  53.1000  S          C
3    0  3    male  35.0  0    0   8.0500  S        NaN
4    0  3    male   NaN  0    0   8.4583  Q        NaN
..  .. ..     ...   ... ..  ...      ... ..        ...
885  0  2    male  27.0  0    0  13.0000  S        NaN
886  1  1  female  19.0  0    0  30.0000  S          B
887  0  3  female   NaN  1    2  23.4500  S        NaN
888  1  1    male  26.0  0    0  30.0000  C          C
889  0  3    male  32.0  0    0   7.7500  Q        NaN

[890 rows x 9 columns]

In [10]:
pd.read_csv('titanic.csv', header=None)

            0       1       2     3      4      5        6         7     8
0    survived  pclass     sex   age  sibsp  parch     fare  embarked  deck
1           0       3    male  22.0      1      0     7.25         S   NaN
2           1       1  female  38.0      1      0  71.2833         C     C
3           1       3  female  26.0      0      0    7.925         S   NaN
4           1       1  female  35.0      1      0     53.1         S     C
..        ...     ...     ...   ...    ...    ...      ...       ...   ...
887         0       2    male  27.0      0      0     13.0         S   NaN
888         1       1  female  19.0      0      0     30.0         S     B
889         0       3  female   NaN      1      2    23.45         S   NaN
890         1       1    male  26.0      0      0     30.0         C     C
891         0       3    male  32.0      0      0     7.75         Q   NaN

[892 rows x 9 columns]

## Parameter names is for the column names to use

In [13]:
pd.read_csv("titanic.csv",
            names=["alive", "class", "gender", "age", "sibsps", "parch", "price" , "emb", "deck"]
)

        alive   class  gender   age sibsps  parch    price       emb  deck
0    survived  pclass     sex   age  sibsp  parch     fare  embarked  deck
1           0       3    male  22.0      1      0     7.25         S   NaN
2           1       1  female  38.0      1      0  71.2833         C     C
3           1       3  female  26.0      0      0    7.925         S   NaN
4           1       1  female  35.0      1      0     53.1         S     C
..        ...     ...     ...   ...    ...    ...      ...       ...   ...
887         0       2    male  27.0      0      0     13.0         S   NaN
888         1       1  female  19.0      0      0     30.0         S     B
889         0       3  female   NaN      1      2    23.45         S   NaN
890         1       1    male  26.0      0      0     30.0         C     C
891         0       3    male  32.0      0      0     7.75         Q   NaN

[892 rows x 9 columns]

## Parameter usecols is for  what the columns to use

In [18]:
v1 = pd.read_csv("titanic.csv",
            usecols=["survived", "pclass", "sex", "age"],
            index_col="survived"
)
v1.head()

          pclass     sex   age
survived
0              3    male  22.0
1              1  female  38.0
1              3  female  26.0
1              1  female  35.0
0              3    male  35.0

## Rename the columns !

In [25]:
v1.columns = ["C", "gender", "Years"]
v1.head()

       C  gender  Years
Alive
0      3    male   22.0
1      1  female   38.0
1      3  female   26.0
1      1  female   35.0
0      3    male   35.0

# Rename the index_set

In [26]:
v1.index.name = "Alive"
v1.head()

       C  gender  Years
Alive
0      3    male   22.0
1      1  female   38.0
1      3  female   26.0
1      1  female   35.0
0      3    male   35.0

#  Clean data
## First read the data, the first rows are not correct

In [78]:
dirty_data = pd.read_csv("titanic_raw.csv")
dirty_data.head()

,,,,,This,is,the,Titanic,Dataset.
It,contains,all,passengers,that,were,aboard,the,titanic,when
the,tragic,disaster,occured,in,the,year,19,1,2
0,0,3,male,22.0,1,0,$7.25,S,NaN
1,1,1,female,38.0,1,0,$71.2833,C,C
2,1,3,female,26.0,0,0,$7.925,S,NaN

## Last 2 rows are not correct

In [79]:
dirty_data.tail()

                                     This    is      the  Titanic  Dataset.
891 0     2         male     24.0       0     0    $10.5        S       NaN
892 0     3         male     34.0       1     1    $14.4        S       NaN
893 0     3         male     36.0       0     0  $7.8958        S       NaN
End  of    the       Dataset                         NaN      NaN       NaN
Get  more  Datasets  on       Kaggle    .   com      NaN      NaN       NaN

## First we delete third row and set header to None ( we will set the columns names later, none means no header)

In [94]:
dirty_data = pd.read_csv("titanic_raw.csv", skiprows=[0,1,2], header=None)
dirty_data.head()

   0  1  2       3     4  5  6         7  8    9
0  0  0  3    male  22.0  1  0     $7.25  S  NaN
1  1  1  1  female  38.0  1  0  $71.2833  C    C
2  2  1  3  female  26.0  0  0    $7.925  S  NaN
3  3  1  1  female  35.0  1  0     $53.1  S    C
4  4  0  3    male  35.0  0  0     $8.05  S  NaN

## Need the last 2 rows deleted

In [82]:
dirty_data.tail()

       0      1          2         3        4   5     6        7    8    9
891  891      0          2      male     24.0   0     0    $10.5    S  NaN
892  892      0          3      male     34.0   1     1    $14.4    S  NaN
893  893      0          3      male     36.0   0     0  $7.8958    S  NaN
894  End     of       the    Dataset                         NaN  NaN  NaN
895  Get   more   Datasets        on   Kaggle   .   com      NaN  NaN  NaN

## Delete the last 2 rows. With drop method and tail method + index ( index because we want to delete the last 2 rows)

In [96]:
dirty_data.drop(dirty_data.tail(2).index, inplace=True)

In [97]:
dirty_data.tail()

       0  1  2     3     4  5  6        7  8    9
889  889  1  1  male  26.0  0  0    $30.0  C    C
890  890  0  3  male  32.0  0  0    $7.75  Q  NaN
891  891  0  2  male  24.0  0  0    $10.5  S  NaN
892  892  0  3  male  34.0  1  1    $14.4  S  NaN
893  893  0  3  male  36.0  0  0  $7.8958  S  NaN

## Set the columns names and all params

In [90]:
dirty_data = pd.read_csv("titanic_raw.csv", 
                         skiprows=[0,1,2], 
                         header=None, 
                         names=["alive", "class", "gender", "age", "sibsps", "parch", "price" , "emb", "deck", "test"]
)
dirty_data.head()

  alive class gender     age sibsps parch price       emb deck test
0     0     0      3    male   22.0     1     0     $7.25    S  NaN
1     1     1      1  female   38.0     1     0  $71.2833    C    C
2     2     1      3  female   26.0     0     0    $7.925    S  NaN
3     3     1      1  female   35.0     1     0     $53.1    S    C
4     4     0      3    male   35.0     0     0     $8.05    S  NaN

In [98]:
dirty_data.tail()

       0  1  2     3     4  5  6        7  8    9
889  889  1  1  male  26.0  0  0    $30.0  C    C
890  890  0  3  male  32.0  0  0    $7.75  Q  NaN
891  891  0  2  male  24.0  0  0    $10.5  S  NaN
892  892  0  3  male  34.0  1  1    $14.4  S  NaN
893  893  0  3  male  36.0  0  0  $7.8958  S  NaN

In [ ]:
dirty_data.to_csv("titanic_clean.csv")

## Now data is clean and we can save it to a new file

# Import Table Data to HTML 
## First we need to install lxml

In [2]:
url = "https://en.wikipedia.org/wiki/1976_Summer_Olympics_medal_table"

## Verify len  because this method take all the tables in the pageq

In [7]:
len(pd.read_html(url))

7

In [22]:
summer_html = pd.read_html(url)[3]
summer_html.head()

  Rank            NOC  Gold  Silver  Bronze  Total
0    1   Soviet Union    49      41      35    125
1    2   East Germany    40      25      25     90
2    3  United States    34      35      25     94
3    4   West Germany    10      12      17     39
4    5          Japan     9       6      10     25

## Index False because we don't want the index column

In [24]:
summer_html.to_csv("summer_1976_html.csv", index=False)